Tekla Open API Reference for Tekla Structures 2025
ControlLine.Color Property
 The color of the control line.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlLine.ControlLineColorEnum Color { get; set; }
Public Property Color As ControlLine.ControlLineColorEnum
	Get
	Set
Property Value
Type: ControlLine.ControlLineColorEnum
See Also
Reference
ControlLine Class
Tekla.Structures.Model Namespace